app/controllers/acts_controller.rb

  def index
    @acts = Act.all
       unless request.subdomain.blank?
    @users = User.find_by_subdomain!(request.subdomain)
    @profile = Profile.where(:user_id => @users)
    else
        @profiles = Profile.all
---
SELECT "acts".* FROM "acts"
SELECT "users".* FROM "users" WHERE ("users"."subdomain" = 'sofresh') LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."user_id" IS NULL)
SELECT "profiles".* FROM "profiles"

  def show
    #@act = Act.find_by_subdomain!(request.subdomain)
   @users = User.find_by_subdomain!(request.subdomain)
     @profile = Profile.where(:user_id => @users)
    @act = Act.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."subdomain" = 'sofresh') LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."user_id" IS NULL)
SELECT "acts".* FROM "acts" WHERE ("acts"."id" = 2) LIMIT 1

  def new
    @act = Act.new
   #@users = User.find_by_subdomain!(request.subdomain)
     @profile = Profile.where(:user_id => @users)
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."user_id" = 1)

  def edit
    @act = Act.find(params[:id])
---
SELECT "acts".* FROM "acts" WHERE ("acts"."id" = 2) LIMIT 1

  def update
    @users = User.find_by_subdomain!(request.subdomain)
    @profile = Profile.where(:user_id => @users)
    @act = Act.find(params[:id])
    if @act.update_attributes(params[:act])
---
SELECT "users".* FROM "users" WHERE ("users"."subdomain" = 'sofresh') LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."user_id" = 1)
SELECT "acts".* FROM "acts" WHERE ("acts"."id" = 2) LIMIT 1
UPDATE "acts" SET "cached_slug" = 'onyx', "photo_content_type" = 'image/jpeg', "photo_file_name" = 'onyx300x100.jpg', "photo_file_size" = 6809, "photo_updated_at" = '2010-07-09 01:10:20.574280', "updated_at" = '2010-07-09 01:10:22.244447' WHERE ("acts"."id" = 2)