app/controllers/profiles_controller.rb

  def index
  @users = User.find_by_subdomain!(request.subdomain)
    @profile = Profile.where(:user_id => @users)
---
SELECT "users".* FROM "users" WHERE ("users"."subdomain" = 'andrew') LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."user_id" = 2)

  def show
  @users = User.find_by_subdomain!(request.subdomain)
  @profile = Profile.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."subdomain" = 'andrew') LIMIT 1
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1

  def edit
  @users = User.all
    @profile = Profile.find(params[:id])
---
SELECT "users".* FROM "users"
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1

  def update
    @profile = Profile.find(params[:id])
    if @profile.update_attributes(params[:profile])
---
SELECT "profiles".* FROM "profiles" WHERE ("profiles"."id" = 2) LIMIT 1
UPDATE "profiles" SET "tagline" = 'When it has to be the Best', "updated_at" = '2010-07-09 03:29:00.806437' WHERE ("profiles"."id" = 1)